WITH src (faculty_name, department_name, office_phone) AS (
    VALUES
        ('Факультет іноземної філології', 'Кафедра іноземної філології та перекладу', '+380441100101'),
        ('Факультет інформаційних технологій, кібербезпеки та робототехніки', 'Кафедра комп''ютерних наук та програмної інженерії', '+380441100102'),
        ('Факультет економіки та менеджменту', 'Кафедра екології та ландшафтного дизайну', '+380441100103'),
        ('Факультет економіки та менеджменту', 'Кафедра економіки, фінансів та обліку', '+380441100104'),
        ('Факультет інформаційних технологій, кібербезпеки та робототехніки', 'Кафедра кібербезпеки та захисту інформації', '+380441100105'),
        ('Факультет психології та соціальних технологій', 'Кафедра загальної та соціальної психології', '+380441100106'),
        ('Факультет економіки та менеджменту', 'Кафедра маркетингу', '+380441100107'),
        ('Факультет психології та соціальних технологій', 'Кафедра практичної та клінічної психології', '+380441100108'),
        ('Юридичний факультет', 'Кафедра права', '+380441100109'),
        ('Факультет психології та соціальних технологій', 'Кафедра соціально-гуманітарних дисциплін', '+380441100110'),
        ('Факультет інформаційних технологій, кібербезпеки та робототехніки', 'Кафедра математичних дисциплін та інноваційного проектування', '+380441100111'),
        ('Факультет економіки та менеджменту', 'Кафедра менеджменту та логістик', '+380441100112')
)
INSERT INTO department (faculty_id, department_name, office_phone)
SELECT f.faculty_id, s.department_name, s.office_phone
FROM src s
         JOIN faculty f ON f.faculty_name = s.faculty_name;
