WITH src (department_name, group_code, start_year) AS (
    VALUES
        ('Кафедра комп''ютерних наук та програмної інженерії', 'CS-23-01', 2023),
        ('Кафедра кібербезпеки та захисту інформації', 'CYB-23-01', 2023),
        ('Кафедра математичних дисциплін та інноваційного проектування', 'MID-23-01', 2023),
        ('Кафедра економіки, фінансів та обліку', 'ECO-23-01', 2023),
        ('Кафедра маркетингу', 'MKT-23-01', 2023),
        ('Кафедра менеджменту та логістик', 'MLG-23-01', 2023),
        ('Кафедра екології та ландшафтного дизайну', 'ELD-23-01', 2023),
        ('Кафедра права', 'LAW-23-01', 2023),
        ('Кафедра загальної та соціальної психології', 'GSP-23-01', 2023),
        ('Кафедра практичної та клінічної психології', 'PCP-23-01', 2023),
        ('Кафедра соціально-гуманітарних дисциплін', 'SHD-23-01', 2023),
        ('Кафедра іноземної філології та перекладу', 'FPT-23-01', 2023)
)
INSERT INTO student_group (department_id, group_code, start_year, monitor_student_id)
SELECT d.department_id, s.group_code, s.start_year, NULL
FROM src s
         JOIN department d ON d.department_name = s.department_name;
